Documents/БронированиеПереговорной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>БронированиеПереговорной</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комната</Name>
					<Type>
						<v8:Type>d7p1:CatalogRef.ПереговорныеКомнаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Form>
				<Properties>
					<Name>ФормаДокумента</Name>
				</Properties>
			</Form>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/БронированиеПереговорной/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Документ.БронированиеПереговорной - Модуль формы документа
////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		// Новый документ - заполняем значения по умолчанию
		Если НЕ ЗначениеЗаполнено(Объект.Организатор) Тогда
			Объект.Организатор = ИмяПользователя();
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания)
			И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
			// По умолчанию бронируем на 30 минут
			Объект.ДатаОкончания = Объект.ДатаНачала + 1800;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// Оповещаем календарь о необходимости обновления
	Оповестить("ИзменениеБронирования");

КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)

	// Автоматически сдвигаем время окончания на 30 минут от начала
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания)
			ИЛИ Объект.ДатаОкончания <= Объект.ДатаНачала Тогда
			Объект.ДатаОкончания = Объект.ДатаНачала + 1800;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
